In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\munna kumar\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\munna kumar\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\munna kumar\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\users\munna kumar\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\munna kumar\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [1]:
import pandas as pd

In [4]:
book_title=['c++','Java','python','javascript']

In [5]:
title=pd.Series(book_title)

In [6]:
title

0           c++
1          Java
2        python
3    javascript
dtype: object

In [7]:
type(title)

pandas.core.series.Series

In [8]:
title[1]

'Java'

In [9]:
title[2]

'python'

In [10]:
title[1:4]

1          Java
2        python
3    javascript
dtype: object

In [ ]:
# pandas

In [10]:
title.index=['a','b','c','d']

In [11]:
title

a           c++
b          Java
c        python
d    javascript
dtype: object

In [12]:
title[0]

'c++'

In [13]:
title['a']

'c++'

In [ ]:
# numpy

In [12]:
import numpy as np

In [13]:
np.array(book_title)

array(['c++', 'Java', 'python', 'javascript'], dtype='<U10')

In [ ]:
# pandas

In [13]:
df=pd.read_csv(r"C:\Users\Munna kumar\Downloads\iris.csv")

In [8]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [8]:
df.head(2)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [9]:
df.describe

<bound method NDFrame.describe of      sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]>

In [2]:
import numpy as np

In [4]:
df = pd.DataFrame(np.random.randint(1,20,(5,3)))

In [5]:
df

    0   1   2
0  12  13   5
1  12  11  13
2  18  13   2
3   9   5   5
4   4   5  13

In [7]:
df.columns=['Col1','Col2','Col3']

In [8]:
df

   Col1  Col2  Col3
0    12    13     5
1    12    11    13
2    18    13     2
3     9     5     5
4     4     5    13

In [11]:
df.index=['A','B','C','D',"E"]

In [12]:
df

   Col1  Col2  Col3
A    12    13     5
B    12    11    13
C    18    13     2
D     9     5     5
E     4     5    13

In [13]:
df['Col2']['E']

5

In [14]:
df[['Col2','Col3']]

   Col2  Col3
A    13     5
B    11    13
C    13     2
D     5     5
E     5    13

In [15]:
df[['Col3','Col3']]

   Col3  Col3
A     5     5
B    13    13
C     2     2
D     5     5
E    13    13

In [17]:
df.shape

(5, 3)

In [20]:
df.head()

   Col1  Col2  Col3
A    12    13     5
B    12    11    13
C    18    13     2
D     9     5     5
E     4     5    13

In [21]:
df.tail()

   Col1  Col2  Col3
A    12    13     5
B    12    11    13
C    18    13     2
D     9     5     5
E     4     5    13

In [23]:
df.tail(2)

   Col1  Col2  Col3
D     9     5     5
E     4     5    13

In [24]:
df.sample(3)

   Col1  Col2  Col3
A    12    13     5
C    18    13     2
D     9     5     5

In [25]:
df

   Col1  Col2  Col3
A    12    13     5
B    12    11    13
C    18    13     2
D     9     5     5
E     4     5    13

In [31]:
df['Col4']= df['Col1']+df['Col2']

In [32]:
df

   Col1  Col2  Col3  Col4
A    12    13     5    25
B    12    11    13    23
C    18    13     2    31
D     9     5     5    14
E     4     5    13     9

In [28]:
df=df.drop('Col4',axis=1)

In [29]:
df

   Col1  Col2  Col3
A    12    13     5
B    12    11    13
C    18    13     2
D     9     5     5
E     4     5    13

In [33]:
df.drop('Col4',axis=1,inplace=True)

In [34]:
df

   Col1  Col2  Col3
A    12    13     5
B    12    11    13
C    18    13     2
D     9     5     5
E     4     5    13

In [35]:
df.iloc[0:2,1:3]

   Col2  Col3
A    13     5
B    11    13

In [36]:
df.loc['A':'B','Col2':'Col3']

   Col2  Col3
A    13     5
B    11    13

In [38]:
df.describe()

           Col1      Col2      Col3
count   5.00000   5.00000   5.00000
mean   11.00000   9.40000   7.60000
std     5.09902   4.09878   5.07937
min     4.00000   5.00000   2.00000
25%     9.00000   5.00000   5.00000
50%    12.00000  11.00000   5.00000
75%    12.00000  13.00000  13.00000
max    18.00000  13.00000  13.00000

In [39]:
import random
df['Col5']= np.random.randint(1,5,(5,1))

In [40]:
df

   Col1  Col2  Col3  Col5
A    12    13     5     2
B    12    11    13     2
C    18    13     2     1
D     9     5     5     1
E     4     5    13     2

In [ ]:
df=df.drop('Col4',axis=1)

In [42]:
df.drop(['Col1','Col5'],axis=1,inplace=True)

In [44]:
df.drop('E',inplace=True)

In [9]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [11]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [18]:
df.isnull().sum()

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [20]:
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')